holiday-plans/app/controllers/api/v1/managers_controller.rb

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def worker_details
    worker = Worker.find(params[:worker_id])

SELECT  "vacation_requests".* FROM "vacation_requests" WHERE "vacation_requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "vacation_requests" SET "status" = $1, "resolved_by" = $2, "updated_at" = $3 WHERE "vacation_requests"."id" = $4  [["status", "approved"], ["resolved_by", 1], ["updated_at", "2021-04-07 14:33:03.811375"], ["id", 2]]
---
  def approve_vacation_request
    vacation_request = VacationRequest.find(params[:vacation_request_id])
    manager = Manager.find(params[:id])
    vacation_request.update(status: params[:status], resolved_by: manager.id)

SELECT  "vacation_requests".* FROM "vacation_requests" WHERE "vacation_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_overlapping_requests
    vacation_request = VacationRequest.find(params[:vacation_request_id])