holiday-plans/app/controllers/api/v1/workers_controller.rb

  def create_vacation_request
    vacation_request = WorkersFacade.create_worker_vacation_request(
      params[:id], params[:start_date], params[:end_date]
    )
---
INSERT INTO "vacation_requests" ("start_date", "end_date", "worker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["start_date", "2022-08-24 00:00:00"], ["end_date", "2022-08-28 00:00:00"], ["worker_id", 63], ["created_at", "2021-04-07 12:54:15.924796"], ["updated_at", "2021-04-07 12:54:15.924796"]]