holiday-plans/app/facades/managers_facade.rb

    def filter_workers_vacation_requests(id, status)
      manager = Manager.find(id)
---
SELECT  "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]