holiday-plans/app/facades/workers_facade.rb

    def filter_worker_vacation_requests(id, status)
      worker = Worker.find(id)
      list_of_requests = worker.get_vacation_requests(status)
      list_of_statuses = list_of_requests.map do |request|
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "vacation_requests".* FROM "vacation_requests" WHERE "vacation_requests"."worker_id" = $1 ORDER BY created_at ASC  [["worker_id", 1]]

    def get_remaining_vacation_days(id)
      worker = Worker.find(id)
---
SELECT  "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]